app/Controllers/ClienteController.php

    public function listado() {
        $modelo = new ClienteModel();
        $datos ['clientes'] = $modelo->findAll();
---
SELECT *
FROM `clientes`