app/Controllers/DispositivoController.php

SELECT *
FROM `clientes`
WHERE `cedula` = '1002345667'
 LIMIT 1
---
    public function obtenerNombreClientePorCedula()
    {
        $cedula = $this->request->getVar('cedula');
        // Lógica para buscar el nombre y el ID del cliente por su cédula en el modelo cliente
        $clienteModel = new ClienteModel();
        $cliente = $clienteModel->where('cedula', $cedula)->first();