app/Controllers/FacturaController.php

SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id` = '1'
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '2'
---
    public function cobrar($orden_id)
    {
        $ordenModel = new OrdenModel;
        $clienteModel = new ClienteModel;
        $dispositivoModel = new DispositivoModel;

        // Obtener detalles de la orden
        $orden = $ordenModel->find($orden_id);

        if (!$orden) {
            return redirect()->back()->with('error', 'La orden no existe o no se encontró');
        }

        // Obtener detalles del ciente asociado al dispositivo
        $dispositivo = $dispositivoModel->find($orden['dispositivo_id']);
        $cliente = $clienteModel->find($dispositivo['cliente_id']);