app/Controllers/OrdenController.php

SELECT *
FROM `clientes`
WHERE `cedula` = '1002345667'
 LIMIT 1
SELECT *
FROM `dispositivos`
WHERE `cliente_id` = '10'
---
    public function buscarDispositivos() {
        $cedula = $this->request->getVar('cedula');

        //buscarcliente por cedula
        $clienteModel = new ClienteModel();
        $cliente = $clienteModel->where('cedula', $cedula)->first();

        if(!$cliente) {
            //si no se encuentra el cliente, deviolver un error
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Cliente no encontrado'
            ]);
        }

        // Buscar los dispositivos asociados al cliente por su id
        $dispositivoModel = new DispositivoModel();
        $dispositivos = $dispositivoModel->where('cliente_id', $cliente['id'])->findAll();