app/Models/DispositivoModel.php

SELECT COUNT(*) AS `numrows`
FROM `dispositivos`
JOIN `clientes` ON `clientes`.`id` = `dispositivos`.`cliente_id`
SELECT `dispositivos`.*, CONCAT(clientes.nombres, " ", clientes.apellidos) as nombreCompleto
FROM `dispositivos`
JOIN `clientes` ON `clientes`.`id` = `dispositivos`.`cliente_id`
 LIMIT 10
---
    public function obtenerDispositivosConCliente()
    {

        return $this->join('clientes', 'clientes.id = dispositivos.cliente_id')->select('dispositivos.*,CONCAT(clientes.nombres, " ", clientes.apellidos) as nombreCompleto')->paginate(10);